<a href="https://colab.research.google.com/github/BhuvneshSain/my-notebooks/blob/master/Assignment_2_1_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import pandas as pd
import numpy as np

# **Problem 5**

In [5]:
df=pd.read_csv('https://media-doselect.s3.amazonaws.com/generic/Ong0rz98dgXBwx3PkPJbkO5pR/drug_overdose.csv')
col='death_by_heroin'
no=2
df

    year  death_by_methadone  death_by_heroin  death_by_synthetic_opioids
0   1999                 784             1960                         730
1   2000                 986             1842                         782
2   2001                1456             1779                         957
3   2002                2358             2089                        1295
4   2003                2972             2080                        1400
5   2004                3845             1878                        1664
6   2005                4460             2009                        1742
7   2006                5406             2088                        2707
8   2007                5518             2399                        2213
9   2008                4924             3041                        2306
10  2009                4696             3278                        2946
11  2010                4577             3036                        3007
12  2011                4418             4397                        2666
13  2012                3932             5925                        2628
14  2013                3591             8257                        3105
15  2014                3400            10574                        5544
16  2015                3301            12989                        9580
17  2016                3373            15469                       19413
18  2017                3194            15482                       28466

In [6]:
def sol(x):
    return np.percentile(df[col],x)

In [7]:
grp1=df[df[col]>sol(95)]
grp1

    year  death_by_methadone  death_by_heroin  death_by_synthetic_opioids
18  2017                3194            15482                       28466

In [8]:
grp2=df[(df[col]<=sol(95)) & (df[col]>sol(80))]
grp2

    year  death_by_methadone  death_by_heroin  death_by_synthetic_opioids
15  2014                3400            10574                        5544
16  2015                3301            12989                        9580
17  2016                3373            15469                       19413

In [9]:
grp3=df[(df[col]<=sol(80)) & (df[col]>sol(50))]
grp3

    year  death_by_methadone  death_by_heroin  death_by_synthetic_opioids
9   2008                4924             3041                        2306
10  2009                4696             3278                        2946
12  2011                4418             4397                        2666
13  2012                3932             5925                        2628
14  2013                3591             8257                        3105

In [11]:
grp4=df[df[col]<sol(50)]
grp4

   year  death_by_methadone  death_by_heroin  death_by_synthetic_opioids
0  1999                 784             1960                         730
1  2000                 986             1842                         782
2  2001                1456             1779                         957
3  2002                2358             2089                        1295
4  2003                2972             2080                        1400
5  2004                3845             1878                        1664
6  2005                4460             2009                        1742
7  2006                5406             2088                        2707
8  2007                5518             2399                        2213

In [16]:
list(grp2['year'])

[2014, 2015, 2016]

# **Problem 4**

In [17]:
df=pd.read_csv('https://media-doselect.s3.amazonaws.com/generic/N9rLGZvLx4M8pMnLBxv2o9ezv/US_Employment_Data.csv')
df

    year  population  labor_force  ...  unemployed_percent  not_in_labor  footnotes
0   1941       99900        55910  ...                 9.9         43990        NaN
1   1942       98640        56410  ...                 4.7         42230        NaN
2   1943       94640        55540  ...                 1.9         39100        NaN
3   1944       93220        54630  ...                 1.2         38590        NaN
4   1945       94090        53860  ...                 1.9         40230        NaN
..   ...         ...          ...  ...                 ...           ...        ...
66  2006      228815       151428  ...                 4.6         77387        1.0
67  2007      231867       153124  ...                 4.6         78743        1.0
68  2008      233788       154287  ...                 5.8         79501        1.0
69  2009      235801       154142  ...                 9.3         81659        1.0
70  2010      237830       153889  ...                 9.6         83941        1.0

[71 rows x 12 columns]

In [18]:
col='labor_force'